/*
Задача, която проверява дали въведен низ от скоби е валиден -  - тоест ако се поставят числа и аритметични знаци
между скобите би могло да се получи валиден аритметичен израз.

Примерни валидни скобни низове са "", "()()", и "({{[]([])}}())[[{}]]", докато невалидни са
 "((", ")(", "([})", "({)}", и "(){}[()]]".
*/


#include <iostream>
#include <stack>

using namespace std;

int main(){

    //създване на стринг, който да въвеждаме от конзолата
    cout<<"Please, enter a text: "<<endl;
    string scopes;
    cin>>scopes;

    /*създаваме стек, в който при наличие на една от скобите - (, { или [ - пъхаме дадената скоба
    и тя застава на върха на структурата от данни*/
    stack <char> sc;

    //итерираме стринга и проверяваме:
    for(int i = 0; i < scopes.size(); i++){
            //ако имаме някоя от следните скоби я пъхаме в стека, като така тя застава на върха
        if(scopes[i] == '(' || scopes[i] == '[' || scopes[i] == '{'){
            sc.push(scopes[i]);
           }

           //ако пък имаме някоя от затварящите скоби:
        else if(scopes[i] == ')' || scopes[i] == '}' || scopes[i] == ']'){
            if(!sc.empty()){ //ако стекът не е празен и, ако съвпадне с някоя отваряща, премахваме върха на стека, който в случая съдържа отварящата скоба
                if((sc.top() == '(' && scopes[i] == ')') || (sc.top() == '[' && scopes[i] == ']') || (sc.top() == '{' && scopes[i] == '}') ){
                    sc.pop();
                }
            }

        }
    }

    //за да бъде стрингът валиден, значи стекът е напълно изпразнен, издаваме съобщение за това
    if(sc.empty()){
        cout<<"Valid string!"<<endl;
    }

    else{
        cout<<"Not a valid string!"<<endl;
    }



    //въведената променлива не е част от програмата, просто забавя конзолата !!!
    int a;
    cin>>a;

    return 0;




}
